{
  "backend/main.mo": "Empty Motoko actor placeholder with no logic.",
  "feature_evidence.json": "Feature evidence report linking a homepage text-color update to affected files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend files used for reference.",
  "frontend/index.css": "Tailwind base styles defining extensive OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app wiring TanStack Router routes and global Brand and Cart providers.",
  "frontend/src/cart/CartProvider.tsx": "Cart context managing items, quantities, persistence, and total price calculation.",
  "frontend/src/components/BottomNav.tsx": "Mobile bottom navigation bar with route highlighting and cart badge.",
  "frontend/src/components/BrandProvider.tsx": "Brand context storing editable brand name and logo with localStorage persistence.",
  "frontend/src/components/Header.tsx": "Responsive header with logo upload, editable brand name, and navigation menu.",
  "frontend/src/components/ProductCard.tsx": "Product card showing image, price, quantity control, and add‑to‑cart behavior.",
  "frontend/src/components/ProductCarousel.tsx": "A horizontal scrollable carousel rendering ProductCard components with left and right navigation buttons.",
  "frontend/src/data/products.ts": "Defines the Product interface and exports arrays of thepla and other product data along with category names.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity using React Query and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity auth state and login/logout behavior.",
  "frontend/src/index.css": "Tailwind CSS setup with custom color variables, dark mode theming, and utility rules including scrollbar hiding.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and renders the root component.",
  "frontend/src/pages/AccountPage.tsx": "Displays a guest account page with profile info and links to contact, FAQ, and placeholder sections.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart with quantity controls, item removal, totals, and an empty‑cart fallback.",
  "frontend/src/pages/CategoriesPage.tsx": "Shows product categories using thepla data and other products, each rendered through a ProductCarousel.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact page with phone, location, email, and Instagram input sections using React state for email and Instagram fields.",
  "frontend/src/pages/FaqPage.tsx": "Displays a list of FAQs with expandable answers using local state to toggle open items.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with a hero section, buy-now logic adding a default product to the cart, and a brand story section.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows a list of static notifications with icons, titles, messages, and timestamps.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, typography, animations, and plugins for styling the app.",
  "project_state.json": "Stores project metadata including features, new requests, issues, and configuration state."
}