{
  "backend/main.mo": "Contains an actor with a buildNotification function that always asserts false, indicating it should never be called.",
  "feature_evidence.json": "Feature evidence report listing two frontend features, their affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of all main frontend source files.",
  "frontend/index.css": "Tailwind base/styles defining color tokens, dark mode variables, and global background/foreground application.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with BrandProvider and CartProvider.",
  "frontend/src/cart/CartProvider.tsx": "Implements a cart context with add, remove, update, clear operations and localStorage persistence.",
  "frontend/src/components/BottomNav.tsx": "Mobile bottom navigation bar with route links and a cart badge showing item count.",
  "frontend/src/components/BrandProvider.tsx": "Brand context storing brand name and logo URL with localStorage and a fallback default logo.",
  "frontend/src/components/Header.tsx": "Header with logo upload, editable brand name, mobile menu toggle, and fallback to default logo on error.",
  "frontend/src/components/ProductCard.tsx": "Displays a product with image, price, optional quantity controls, and add‑to‑cart handling.",
  "frontend/src/components/ProductCarousel.tsx": "Carousel component that horizontally scrolls through ProductCard items with left and right buttons and optional quantity controls.",
  "frontend/src/data/products.ts": "Defines the Product interface and exports arrays of thepla and other product data along with category labels.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to Internet Identity and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, stored identity loading, and status management via AuthClient.",
  "frontend/src/index.css": "Tailwind setup with custom CSS variables, themes, fonts, and scroll-hiding utilities for the UI.",
  "frontend/src/main.tsx": "Application entry point that mounts React, wrapping the app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccountPage.tsx": "Account page showing a guest profile and navigation links for contact, FAQ, and upcoming features.",
  "frontend/src/pages/CartPage.tsx": "Cart page that displays cart items with quantity controls, removal options, and an empty cart fallback.",
  "frontend/src/pages/CategoriesPage.tsx": "Displays product categories using theplas and other products, each rendered in a ProductCarousel.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact page with phone, location, email, and Instagram inputs using React state and styled cards.",
  "frontend/src/pages/FaqPage.tsx": "Displays an FAQ list with expandable items managed by component state.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with a hero section, brand story, and a Buy Now button that adds a default product to the cart.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows a list of static notifications with icons and timestamps, falling back to an empty-state message if none exist.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugins for container queries and animations.",
  "project_state.json": "Stores project metadata including feature requests, branding tasks, and project configuration state."
}