{
  "backend/main.mo": "Empty Motoko actor with no methods or logic.",
  "feature_evidence.json": "Feature evidence report describing a frontend update to render black paragraph text in the Women empowerment section.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files describing their roles and features.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color tokens, dark mode variables, and global background/text/border styles.",
  "frontend/index.html": "Basic HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with BrandProvider and CartProvider.",
  "frontend/src/cart/CartProvider.tsx": "React context managing cart items with add, remove, update, clear operations and localStorage persistence.",
  "frontend/src/components/BottomNav.tsx": "Mobile bottom navigation bar showing route links and cart badge count.",
  "frontend/src/components/BrandProvider.tsx": "React context handling editable brand name and logo with localStorage persistence.",
  "frontend/src/components/Header.tsx": "Responsive header with editable brand name, logo upload, and desktop/mobile navigation.",
  "frontend/src/components/ProductCard.tsx": "Displays product info with optional quantity controls and add‑to‑cart functionality.",
  "frontend/src/components/ProductCarousel.tsx": "Horizontal scroll carousel rendering ProductCards with left/right navigation buttons.",
  "frontend/src/data/products.ts": "Defines Product interface and exports arrays of thepla products, other products, and product categories.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor using React Query, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, and identity loading using Dfinity AuthClient.",
  "frontend/src/index.css": "Tailwind CSS setup with custom theme variables and base styling including light/dark color palettes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccountPage.tsx": "Renders the user account page with links to contact, FAQ, and placeholder sections.",
  "frontend/src/pages/CartPage.tsx": "Displays the shopping cart, allowing quantity changes, item removal, and showing totals.",
  "frontend/src/pages/CategoriesPage.tsx": "Shows product categories with carousels for theplas and other products.",
  "frontend/src/pages/ContactPage.tsx": "Contact page with phone, location, email, and Instagram fields using icons and controlled inputs.",
  "frontend/src/pages/FaqPage.tsx": "FAQ page displaying expandable question-and-answer items with toggle state.",
  "frontend/src/pages/HomePage.tsx": "Home page with hero section, story content, and buy-now logic adding a default product to the cart.",
  "frontend/src/pages/NotificationsPage.tsx": "Notifications page rendering a list of static notification cards with icons and timestamps.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and enabling plugins.",
  "project_state.json": "Project state metadata tracking features, requests, and configuration for ongoing work."
}