{
  "backend/main.mo": "Empty Motoko actor placeholder.",
  "feature_evidence.json": "Report mapping product features to related source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Plain-text collection of short descriptions for all frontend React components and pages.",
  "frontend/index.css": "Tailwind base setup defining light/dark theme CSS variables and global styles.",
  "frontend/index.html": "Root HTML file loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with BrandProvider and CartProvider.",
  "frontend/src/cart/CartProvider.tsx": "React context managing cart items, persistence, and quantity/total calculations.",
  "frontend/src/components/BottomNav.tsx": "Mobile bottom navigation bar with active state and cart badge.",
  "frontend/src/components/BrandProvider.tsx": "React context for storing brand name and logo with localStorage persistence.",
  "frontend/src/components/Header.tsx": "Responsive header with editable brand name, logo upload, and navigation menu.",
  "frontend/src/components/ProductCard.tsx": "Renders a product card with image, price, optional quantity controls, and an add‑to‑cart button using cart context.",
  "frontend/src/components/ProductCarousel.tsx": "Displays a horizontally scrollable list of ProductCard components with left/right scroll buttons.",
  "frontend/src/data/products.ts": "Defines the Product interface and exports categorized product arrays for theplas and other items.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, invalidating related queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context providing identity loading, login, logout, and status tracking.",
  "frontend/src/index.css": "Tailwind setup defining CSS variables for light/dark themes and global styles including scrollbar hiding.",
  "frontend/src/main.tsx": "Bootstraps the app with React, wrapping it in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccountPage.tsx": "Renders an account page with user info and links to contact, FAQ, and placeholder sections.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart with item management, quantity controls, and an order summary, handling empty-cart and price formatting states.",
  "frontend/src/pages/CategoriesPage.tsx": "Displays product categories with carousels for theplas and other products using predefined data sets.",
  "frontend/src/pages/ContactPage.tsx": "Provides contact information and form fields for email and Instagram input within styled info sections.",
  "frontend/src/pages/FaqPage.tsx": "Shows an interactive FAQ list with expandable items controlled by local state.",
  "frontend/src/pages/HomePage.tsx": "Home landing page featuring hero content, brand story, and sections highlighting mission and values.",
  "frontend/src/pages/NotificationsPage.tsx": "Lists static notifications with icons and timestamps, falling back to an empty state message when none exist.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, typography, container settings, and animations with custom plugins.",
  "project_state.json": "Defines project state metadata and lists existing website features such as branding, story sections, product categories, and other product sliders with their requirement IDs and versions."
}