{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "JSON report placeholder with no features listed.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files including components, pages, styles, and config.",
  "frontend/index.css": "Tailwind base/styles defining CSS variables for light/dark themes and global styling.",
  "frontend/index.html": "Basic HTML page mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with BrandProvider and CartProvider.",
  "frontend/src/cart/CartProvider.tsx": "Cart context managing items, persistence, and total calculations.",
  "frontend/src/components/BottomNav.tsx": "Mobile bottom navigation bar with route links and cart badge.",
  "frontend/src/components/BrandProvider.tsx": "Context for editable brand name and logo with localStorage persistence.",
  "frontend/src/components/Header.tsx": "Header with editable brand name/logo and responsive navigation.",
  "frontend/src/components/ProductCard.tsx": "Product display card with image, price, optional quantity controls, and add-to-cart logic.",
  "frontend/src/components/ProductCarousel.tsx": "Horizontal product carousel with scroll buttons and ProductCard items.",
  "frontend/src/data/products.ts": "Defines the Product interface and exports arrays of thepla and other product items along with category labels.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor using react-query, updating it when the user's identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context and provider with login, logout, and identity restoration logic.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables, themes, and utility styles including dark mode and scrollbar hiding.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app and wraps it with query and identity providers.",
  "frontend/src/pages/AccountPage.tsx": "Renders the account page with user info, links to contact and FAQ, and placeholders for future features.",
  "frontend/src/pages/CartPage.tsx": "Displays cart items with quantity controls and summary, or an empty-cart prompt linking to product categories.",
  "frontend/src/pages/CategoriesPage.tsx": "Shows categorized thepla products and other products using a carousel, with a scrolling quantity note.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact page with phone, location, email, and Instagram fields, using local state for email and Instagram inputs.",
  "frontend/src/pages/FaqPage.tsx": "Displays an accordion-style FAQ section backed by a static list and toggleable open state.",
  "frontend/src/pages/HomePage.tsx": "Home page with hero banner, story content, and a Buy Now action that adds a default product to the cart and navigates to the cart.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows a list of predefined notifications with icons, titles, messages, and timestamps.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, radii, and animations, with plugins for animations and typography.",
  "project_state.json": "Metadata describing project state, architecture, known issues, and generated images for an ICP-based thepla e-commerce site."
}