{
  "backend/main.mo": "Minimal Motoko canister actor with no logic.",
  "feature_evidence.json": "Feature evidence report linking contrast-related UI updates to affected frontend files and components.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend source files.",
  "frontend/index.css": "Tailwind base styles defining light/dark OKLCH color tokens and global background/foreground behavior.",
  "frontend/index.html": "HTML entry mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up global providers and TanStack Router routes for all main pages.",
  "frontend/src/cart/CartProvider.tsx": "Cart context managing item storage, quantity updates, and localStorage persistence.",
  "frontend/src/components/BottomNav.tsx": "Mobile bottom navigation bar with icons and a dynamic cart badge.",
  "frontend/src/components/BrandProvider.tsx": "Brand context handling editable brand name and logo with localStorage persistence.",
  "frontend/src/components/Header.tsx": "Header with editable brand name, logo upload support, menu toggling, and fallback logo handling.",
  "frontend/src/components/ProductCard.tsx": "Product card showing image, pricing, optional quantity controls, and add‑to‑cart actions.",
  "frontend/src/components/ProductCarousel.tsx": "Horizontal scrollable carousel that renders ProductCard components with optional quantity controls and left/right scroll buttons.",
  "frontend/src/data/products.ts": "Defines the Product interface and exports categorized product lists for theplas and other items along with product category names.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s Internet Identity, recreating and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities, handling login/logout, and exposing status flags.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables, global styles, scrollbar hiding, and font import.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccountPage.tsx": "Displays a guest account overview with links to contact, FAQ, and placeholder sections for saved items and addresses.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart with item management, quantity controls, totals, and an empty-cart fallback.",
  "frontend/src/pages/CategoriesPage.tsx": "Shows product categories by rendering carousels for each thepla category and a separate section for other products.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact page with phone, location, email, and Instagram inputs using React and Tailwind.",
  "frontend/src/pages/FaqPage.tsx": "Displays a list of FAQs with expandable items controlled by component state.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with a hero section, story content, and a Buy Now button that adds a default product to the cart.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows a list of static notifications with icons and fallback UI when none are available.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, fonts, animations, and plugins.",
  "project_state.json": "Stores project metadata, feature requests, and current state for text contrast improvements."
}